/*1. Числа от 1 до 100
Напишете функция, която отпечатва числата от 1 до 100, всяко на нов ред.*/

function numbersTo() {
  for (let i = 1; i <= 100; i++) {
    console.log(i);
  }
}

/*2. Числата от N до 1 в обратен ред
Напишете функция, която получава положително число n, въведено от потребителя и печата числата от n до 1 в обратен ред. Въведеното число n, винаги ще бъде по-голямо от 1.
Примерен вход и изход
вход изход вход изход вход изход
(["2"]) 2 1 (["3"]) 3 2 1 (["5"]) 5 4 3 2 1*/

function numbersToOne(arr) {
  let n = Number(arr[0]);
  for (let i = n; i > 0; i--) {
    console.log(i);
  }
}

/*3. Числата от 1 до N през 3
Напишете функция, която получава число n и отпечатва числата от 1 до n през 3.
Примерен вход и изход
вход изход вход изход вход изход
(["10"]) 1 4 7 10 (["7"]) 1 4 7 (["15"]) 1 4 7 10 13*/

function numbersStepThree(arr) {
  let n = Number(arr[0]);
  for (let i = 1; i <= n; i = i + 3) {
    console.log(i);
  }
}

/*4. Четни степени на 2
Да се напише функция, която получава число n и печата четните степени на 2 ≤ 2n: 20, 22, 24, 26, …, 2n.
Примерен вход и изход
вход изход вход изход вход изход вход изход вход изход
(["3"]) 1 4 (["4"]) 1 4 16 (["5"]) 1 4 16 (["6"]) 1 4 16 64 (["7"]) 1 4 16 64*/

function evenPowers(arr) {
  let n = Number(arr[0]);
  for (let i = 0; i <= n; i += 2) {
    console.log(Math.pow(2, i));
  }
}

/*5. Поток от символи
Напишете функция, която получава текст (стринг) и печата всеки символ от текста на отделен ред.
Примерен вход и изход
вход изход вход изход
(["softuni"]) s o f t u n i (["ice cream"]) i c e c r e a m*/

function chars(arr) {
  let text = arr[0];
  for (let i = 0; i < text.length; i++) {
    console.log(text[i]);
  }
}

/*6. Сумиране на гласните букви
Да се напише функция, която получава, изчислява и отпечатва сумата от стойностите на гласните букви според таблицата по-долу:
буква a e i o u
стойност 1 2 3 4 5
Примерен вход и изход
вход изход коментар
(["hello"]) 6 e + o = 2 + 4 = 6
(["hi"]) 3 i = 3
(["bamboo"]) 9 a + o + o = 1 + 4 + 4 = 9
(["beer"]) 4 e + e = 2 + 2 = 4*/

function vowels(arr) {
  let text = arr[0];
  let sum = 0;
  for (let i = 0; i < text.length; i++) {
    let ch = text[i];
    switch (ch) {
      case "a":
        sum += 1;
        break;
      case "e":
        sum += 2;
        break;
      case "i":
        sum += 3;
        break;
      case "o":
        sum += 4;
        break;
      case "u":
        sum += 5;
        break;
    }
  }
  console.log(sum);
}

/*7. Сумиране на числа
Напишете функция, която получава цяло число n, сумира всички негови цифри и отпечатва сумата.
Вход
Функцията получава число n.
Изход
Да се отпечата на конзолата един ред:
"The sum of the digits is:{sum}" – където sum е сумата на отделните цифри.
Примерен вход и изход
вход изход вход изход
(["1234"]) The sum of the digits is:10 (["564891"]) The sum of the digits is:33*/

function sumOfNumbers(arr) {
  let num = arr[0];
  let sum = 0;
  for (let i = 0; i < num.length; i++) {
    sum = sum + Number(num[i]);
  }
  console.log(`The sum of the digits is:${sum}`);
}

/*8. Числа, които се делят на 9
Напишете функция, която получава две числа и принтира на конзолата, всички числа в диапазона, които се делят на 9 без остатък, както и тяхната сума. На първия ред отпечатайте сумата на числата, а на следващите редове отговарящите на условието числа.
Примерен вход и изход
вход изход
(["100", "200"]) The sum: 1683 108 117 126 135 144 153 162 171 180 189 198*/

function numbers(arr) {
  let num1 = Number(arr[0]);
  let num2 = Number(arr[1]);
  let sum = 0;
  for (let i = num1; i <= num2; i++) {
    if (i % 9 === 0) {
      sum = sum + i;
    }
  }
  console.log(`The sum: ${sum}`);

  for (let i = num1; i <= num2; i++) {
    if (i % 9 === 0) {
      console.log(i);
    }
  }
}
